// LibTest.cpp : 此文件包含 "main" 函数。程序执行将在此处开始并结束。
//
#include<iostream>
#include<streambuf>
#include<fstream>
#include <iostream>
#include <string>
#include<iomanip>

using namespace std;

union aaa
{
    double data;
    int data1[2];
    char data2[8];
};

wstring keys = L"白入把爸百班办半包饱北贝被本比边别不才草册长厂吵车成吃尺虫出穿船窗床春次从打大但当刀到道的灯地点电东冬动都豆多对儿耳二发反饭方放飞分风千高哥个给更工公共狗瓜关光广国果过孩海好合和河很红后花画话还回会火机几己加家见江交叫姐巾今金进京经九就军开看可课口哭快来老乐里力立脸两亮了林六妈马猫毛没每美妹门们米面民明木目那奶你年鸟牛农女胖跑朋皮片票平七奇起气千前青秋去全然让人日三山上少身声舌师十什石时市是手书树水双谁说岁他她台四太天条田跳听同头土外玩晚为万王网卫文我问午五西习洗下先现向小校笑些心兴星行学雪牙羊阳样要爷也业叶页衣医因阴音用有又鱼羽雨语元月云再在早站找这真知中正直只竹主住桌着子字自走作坐做益以一";


void decode1()
{
    
    wstring data[] = {
L"白白白白白白笑放 ",
L"洗鸟饭九玩个长什 ",
L"面加妹车穿加刀飞 ",
L"出饱舌高书然东什 ",
L"很半哥跳里加点飞 ",
L"很河是几玩虫春什 ",
L"牛妈姐班农哭北飞 ",
L"人明日巾尺江五十 ",
L"多但飞还文双秋放 ",
L"千瓜片豆就妈晚方 ",
L"二瓜片豆就妈被放 ",
L"起立些没大羊当放 ",
L"木立些没大羊儿放 ",
L"课问千冬金对放放 ",
L"木立些没大羊儿放 ",
L"起立些没大羊当放 ",
L"二瓜片豆就妈被放 ",
L"千瓜片豆就妈晚方 ",
L" ",
L"白白白白白白笑放 ",
L"洗鸟饭九玩个长飞 ",
L"面加妹车穿加刀飞 ",
L"耳饱舌高书然东飞 ",
L"很半哥跳里加点飞 ",
L"交河是几玩虫春飞 ",
L"日妈姐班农哭北飞 ",
L"四明日巾尺江五放 ",
L"过但飞还文双秋放 ",
L"跳画了会少火四放 ",
L"跳画了会少火白飞 ",
L"行午叫的亮前虫飞 ",
L"行午叫的亮前的飞 ",
L"上边是玩草向东飞 ",
L"行午叫的亮前的飞 ",
L"行午叫的亮前虫飞 ",
L"跳画了会少火白飞 ",
L"跳画了会少火四放 ",
L" ",
L"白白白白白白笑放 ",
L"些爷来进笑木船什 ",
L"不全老飞笑狗发飞 ",
L"巾火不冬孩行公什 ",
L"很出经们红跑广飞 ",
L"她里跳二土工公什 ",
L"让快星爸笑行耳飞 ",
L"白对点明天狗出什 ",
L"才果厂对女校现放 ",
L"小海也五心姐小放 ",
L"小海也五心姐穿什 ",
L"电马穿妈都农二飞 ",
L"电马穿妈都农公什 ",
L"也厂过听窗朋广飞 ",
L"电马穿妈都农公什 ",
L"电马穿妈都农二飞 ",
L"小海也五心姐穿什 ",
L"小海也五心姐小放 ",
L" ",
L"白白白白白白笑放 ",
L"很工乐片冬马船什 ",
L"风加小果风豆发飞 ",
L"羊孩双刀很天公什 ",
L"胖对晚明票亮广飞 ",
L"后口西什广不公什 ",
L"脸金全那窗然耳飞 ",
L"就半广家吵行虫什 ",
L"跑条老乐卫猫现放 ",
L"二姐哥厂外耳小放 ",
L"二姐哥厂外耳穿什 ",
L"们十哭条鸟京二飞 ",
L"们十哭条鸟京公什 ",
L"声雪灯高跑了广飞 ",
L"们十哭条鸟京公什 ",
L"们十哭条鸟京二飞 ",
L"二姐哥厂外耳穿什 ",
L"二姐哥厂外耳小放 ",
L" ",
L"白白白白白白笑放 ",
L"胖公秋牙面军船什 ",
L"雪火林可条不发飞 ",
L"没金平羊次鸟公什 ",
L"风被进到洗红广飞 ",
L"河也比电孩舌工什 ",
L"岁文那卫尺广耳飞 ",
L"鸟合合舌话经虫什 ",
L"起土刀里对样先放 ",
L"农东反金红现向放 ",
L"农东反金红现出什 ",
L"叫起都把四地二飞 ",
L"叫起都把四地公什 ",
L"从先还入风花广飞 ",
L"叫起都把四地公什 ",
L"叫起都把四地二飞 ",
L"农东反金红现出什 ",
L"农东反金红现向放 ",
L" ",
L"白白白白白白笑放 ",
L"爸舌我灯动阳虫什 ",
L"厂尺问瓜西都对飞 ",
L"孩河朋王片军哥什 ",
L"石船里明今才工飞 ",
L"片机军回道笑风什 ",
L"国五皮亮孩不冬飞 ",
L"好阳学九六习草什 ",
L"飞胖日三儿加我放 ",
L"见七洗飞哭二不放 ",
L"白白白白白白白白 ",
L"去平洗飞哭二东十 ",
L"白白白白白白白白 ",
L"己快画回少同耳放 ",
L"白白白白白白白白 ",
L"去平洗飞哭二东十 ",
L"白白白白白白白白 ",
L"见七洗飞哭二不放 ",
L" ",
L"白白白白白白笑放 ",
L"的瓜皮老口哭尺什 ",
L"吃金反猫下光豆飞 ",
L"飞看些气网巾千什 ",
L"姐己木发她市个飞 ",
L"脸为十脸现林分什 ",
L"他片鸟石次很东飞 ",
L"分从然九农东册什 ",
L"虫学江市回对午放 ",
L"儿目卫才条还白放 ",
L"白白白白白白白白 ",
L"七那卫才条还窗十 ",
L"白白白白白白白白 ",
L"哥加果你反妹当放 ",
L"白白白白白白白白 ",
L"七那卫才条还窗十 ",
L"白白白白白白白白 ",
L"儿目卫才条还白放 ",
L" ",
L"白白白白白白笑放 ",
L"牙农乐过儿白车什 ",
L"分话饭车入笑电飞 ",
L"条船飞九草爷反什 ",
L"要分土经里会飞飞 ",
L"反前平包虫爸耳什 ",
L"面但哥见办儿刀飞 ",
L"到被豆那票跳比什 ",
L"要石跑先心舌卫放 ",
L"脸三笑把好文船放 ",
L"白白白白白白白白 ",
L"饭山笑把好文放十 ",
L"白白白白白白白白 ",
L"后妈都力什洗给放 ",
L"白白白白白白白白 ",
L"饭山笑把好文放十 ",
L"白白白白白白白白 ",
L"脸三笑把好文船放 ",
L" ",
L" ",
L"白白白白白白笑放 ",
L"和口米工狗午不什 ",
L"业巾四出跳机打飞 ",
L"你半果加星红电什 ",
L"下花今兴会亮东飞 ",
L"还个谁关卫里到什 ",
L"样文向洗好册虫飞 ",
L"头江问农别百爸什 ",
L"身家京国学美玩放 ",
L"人办哥反反今饭放 ",
L"白白白白白白白白 ",
L"我办哥反反今花十 ",
L"白白白白白白白白 ",
L"多手动灯姐草己放 ",
L"白白白白白白白白 ",
L"我办哥反反今花十 ",
L"白白白白白白白白 ",
L"人办哥反反今饭放 ",
L" ",
L"白白白白白白笑放 ",
L"大农过电叫耳业十 ",
L"田看光儿午把不飞 ",
L"水课哭关不奇才什 ",
L"入牙画校明爷册飞 ",
L"包舌给马前去贝什 ",
L"猫吃厂书打师把飞 ",
L"不合分九民工洗十 ",
L"舌开冬国千耳条放 ",
L"然也土气画先河放 ",
L"白白白白白白白白 ",
L"平也土气画先可十 ",
L"白白白白白白白白 ",
L"入老跑入了金立放 ",
L"白白白白白白白白 ",
L"平也土气画先可十 ",
L"白白白白白白白白 ",
L"然也土气画先河放 ",
L" ",
L"白白白白白白笑放 ",
L"那她办军面什阳放 ",
L"听到田跳外光包飞 ",
L"才那交刀玩来半飞 ",
L"多都同问脸明半飞 ",
L"对会工马你大要放 ",
L"狗公条她公家些放 ",
L"己办就卫两牛跳放 ",
L"起儿海果外太师放 ",
L"孩万玩广人习脸放 ",
L"白白白白白白白白 ",
L"海万玩广人习朋十 ",
L"白白白白白白白白 ",
L"乐他工羊边花青放 ",
L"白白白白白白白白 ",
L"海万玩广人习朋十 ",
L"白白白白白白白白 ",
L"孩万玩广人习脸放 ",
L" ",
L"白白白白白白笑放 ",
L"机交美当卫东船什 ",
L"看灯先床军你二飞 ",
L"四四灯花更心工什 ",
L"明声三晚地农光飞 ",
L"花西点白狗气更什 ",
L"少我北饱点别儿飞 ",
L"多万人花四天吃什 ",
L"美什校要个到下放 ",
L"奶道女亮奶脸厂饭 ",
L"机羊学比我立个饭 ",
L"儿吃车千己然火饭 ",
L"册开年打红然经饭 ",
L"不的大本点农看饭 ",
L"册开年打红然经饭 ",
L"儿吃车千己然火饭 ",
L"机羊学比我立个饭 ",
L"奶道女亮奶脸厂饭 ",
L" ",
L"白白白白白白笑放 ",
L"加打心哭是火穿什 ",
L"叫木都水耳千耳飞 ",
L"朋包毛哭九把更什 ",
L"朋公课片青林狗飞 ",
L"公穿时西行人哥什 ",
L"更白同话办平都飞 ",
L"习平没心些开厂什 ",
L"口岁姐笑花机午放 ",
L"民北海更树交米饭 ",
L"公马女动书交是饭 ",
L"牙洗民公瓜万卫饭 ",
L"牙洗民公瓜万些饭 ",
L"军朋反年网海学饭 ",
L"牙洗民公瓜万些饭 ",
L"牙洗民公瓜万卫饭 ",
L"公马女动书交是饭 ",
L"民北海更树交米饭 ",
L" ",
L"白白白白白白笑放 ",
L"市课前了大去出什 ",
L"被午立头狗窗儿飞 ",
L"现灯牙共要交个什 ",
L"反女然己多不公飞 ",
L"来笑女跑下家千什 ",
L"立看小长都册冬飞 ",
L"千次天皮当风草什 ",
L"点被台卫快学卫放 ",
L"姐面水儿也现田饭 ",
L"会他草公也现百方 ",
L"还说六里画光春方 ",
L"还说六里画光冬方 ",
L"会把美床多我多方 ",
L"还说六里画光冬方 ",
L"还说六里画光春方 ",
L"会他草公也现百方 ",
L"姐面水儿也现田饭 ",
L" ",
L"白白白白白白笑放 ",
L"秋电点经巾日虫什 ",
L"问山明本市米多飞 ",
L"书白加网风孩高什 ",
L"包石洗六石洗个飞 ",
L"公山放经女毛飞什 ",
L"快课师午跑笑灯飞 ",
L"全胖江农头要比什 ",
L"把猫江动天成晚放 ",
L"去厂起班放书草方 ",
L"电谁十办放书千方 ",
L"金工晚打开瓜回方 ",
L"下四西打开瓜进方 ",
L"个我画校田农就方 ",
L"下四西打开瓜进方 ",
L"金工晚打开瓜回方 ",
L"电谁十办放书千方 ",
L"去厂起班放书草方 ",
L" ",
L"白白白白白白笑放 ",
L"力可狗吵是孩尺什 ",
L"平贝什了百乐都飞 ",
L"校课飞机才胖分什 ",
L"加道奶胖厂班千飞 ",
L"鸟海你加包合二什 ",
L"她力十比地为大飞 ",
L"谁王好今军师办什 ",
L"厂民业机出土条放 ",
L"洗舌牛吵三立国方 ",
L"床饱去吵三立里方 ",
L"贝话九见乐片鸟方 ",
L"贝话九见乐片前方 ",
L"加身习分别当然方 ",
L"贝话九见乐片前方 ",
L"贝话九见乐片鸟方 ",
L"床饱去吵三立里方 ",
L"洗舌牛吵三立国方 ",
L" ",
L"白白白白白白笑放 ",
L"那很起妹地起成什 ",
L"师入放什立打冬飞 ",
L"半海片王边脸饭什 ",
L"十江文起书点方飞 ",
L"天草厂西金万动什 ",
L"上台卫牛女巾窗飞 ",
L"花们巾下奶多业十 ",
L"力明石没手比谁放 ",
L"果方年军本先脸方 ",
L"上加牛军本先让方 ",
L"小十说树起瓜天方 ",
L"小十说树起瓜文方 ",
L"下青师上厂卫五方 ",
L"小十说树起瓜文方 ",
L"小十说树起瓜天方 ",
L"上加牛军本先让方 ",
L"果方年军本先脸方 " ,
L"end"};

    wstring val;
    int counter = 0;

    fstream fs("C:\\111\\data.txt");

    auto fx = [](wchar_t wch) {
        for (int i = 0; i < keys.size(); i++)
        {

            if (wch == keys[i])
            {
                return i;
            }
        }

        return -1;

    };

    aaa a;
    for (int index =0 ; data[index]!=L"end"; index++)
    {
        val = data[index];
        if (val == L" ")
        {
            continue;
        }
        

        counter++;
        for (int i = 0; i < 8; i++)
        {
            int ret = fx(val[i]);
            if (ret == -1 || ret>255)
            {
                cout << "error" << endl;
            }
            a.data2[i] = ret;
           
        }
       // cout << setprecision(20)<< a.data << endl;
        fs << setprecision(20) << a.data << endl;
        if (counter % 9 == 0)
            fs << endl;
    }
    

cout << counter << endl;

}





int main()
{

    wcout.imbue(locale("chs"));
   
    decode1();


    return 0;


    ifstream  ffs;
  //  ffs.open(R"(C:\\111\test.txt)");
   


    istream& iis = ffs;


    cout << typeid(iis).name() << endl;

    if (iis.eof())
    {
        cout << "aa" << endl;
    }

    char buffer[512];

    cout  << endl;

    if (iis.read(buffer, 512))
    {
        cout << "读取成功" << endl;
    }


    return 0;
    char ch;
    std::streambuf* pbuf;

    ifstream  fs;
    fs.open(R"(C:\\111\test.txt)");
    pbuf = fs.rdbuf();
    istream &stream = fs;

    pbuf = fs.rdbuf();

    cout << pbuf->in_avail() << endl;

    char arr[1024];
    string sss;

    ch = stream.get();

    cout << ch << endl;

    ch = stream.get();

    cout << ch << endl;

    streampos pos = stream.tellg();

    cout << pos << endl;


    streampos curpos = pbuf->pubseekoff(0, ios_base::cur);


    pos = pbuf->pubseekoff(0, ios_base::end);

    cout << pos << endl;



    pos = pbuf->pubseekpos(curpos);

    cout << pos << endl;

    pos = stream.tellg();

    cout << pos << endl;

    ch = stream.get();

    cout << ch << endl;
   

}
